alibaba/AliOS-Things/platform/mcu/m487jidae/hal/common/PeripheralPins.c
//*** SPI_MISO ***
const PinMap PinMap_SPI_MISO[] = { 
    { PA_1, 	 SPI_0 , 	 SYS_GPA_MFPL_PA1MFP_SPI0_MISO  },
    { PA_9, 	 SPI_2 , 	 SYS_GPA_MFPH_PA9MFP_SPI2_MISO  },
    { PA_14, 	 SPI_2 , 	 SYS_GPA_MFPH_PA14MFP_SPI2_MISO  },
    { PB_5, 	 SPI_1 , 	 SYS_GPB_MFPL_PB5MFP_SPI1_MISO  },
    { PB_9, 	 SPI_3 , 	 SYS_GPB_MFPH_PB9MFP_SPI3_MISO  },
    { PB_13, 	 SPI_0 , 	 SYS_GPB_MFPH_PB13MFP_SPI0_MISO  },
    { PC_3, 	 SPI_1 , 	 SYS_GPC_MFPL_PC3MFP_SPI1_MISO  },
    { PC_7, 	 SPI_1 , 	 SYS_GPC_MFPL_PC7MFP_SPI1_MISO  },
    { PC_12, 	 SPI_3 , 	 SYS_GPC_MFPH_PC12MFP_SPI3_MISO  },
    { PD_1, 	 SPI_0 , 	 SYS_GPD_MFPL_PD1MFP_SPI0_MISO  },
    { PD_7, 	 SPI_1 , 	 SYS_GPD_MFPL_PD7MFP_SPI1_MISO  },
    { PE_1, 	 SPI_1 , 	 SYS_GPE_MFPL_PE1MFP_SPI1_MISO  },
    { PE_3, 	 SPI_3 , 	 SYS_GPE_MFPL_PE3MFP_SPI3_MISO  },
    { PE_9, 	 SPI_2 , 	 SYS_GPE_MFPH_PE9MFP_SPI2_MISO  },
    { PF_7, 	 SPI_0 , 	 SYS_GPF_MFPL_PF7MFP_SPI0_MISO  },
    { PG_4, 	 SPI_2 , 	 SYS_GPG_MFPL_PG4MFP_SPI2_MISO  },
    { PG_7, 	 SPI_3 , 	 SYS_GPG_MFPL_PG7MFP_SPI3_MISO  },
    { PH_4, 	 SPI_1 , 	 SYS_GPH_MFPL_PH4MFP_SPI1_MISO  },
    { NC,   NC,    0 }
};

//*** SPI_SCLK ***
const PinMap PinMap_SPI_SCLK[] = { 
    { PA_2, 	 SPI_0 , 	 SYS_GPA_MFPL_PA2MFP_SPI0_CLK  },
    { PA_7, 	 SPI_1 , 	 SYS_GPA_MFPL_PA7MFP_SPI1_CLK  },
    { PA_10, 	 SPI_2 , 	 SYS_GPA_MFPH_PA10MFP_SPI2_CLK  },
    { PA_13, 	 SPI_2 , 	 SYS_GPA_MFPH_PA13MFP_SPI2_CLK  },
    { PB_3, 	 SPI_1 , 	 SYS_GPB_MFPL_PB3MFP_SPI1_CLK  },
    { PB_11, 	 SPI_3 , 	 SYS_GPB_MFPH_PB11MFP_SPI3_CLK  },
    { PB_14, 	 SPI_0 , 	 SYS_GPB_MFPH_PB14MFP_SPI0_CLK  },
    { PC_1, 	 SPI_1 , 	 SYS_GPC_MFPL_PC1MFP_SPI1_CLK  },
    { PC_10, 	 SPI_3 , 	 SYS_GPC_MFPH_PC10MFP_SPI3_CLK  },
    { PD_2, 	 SPI_0 , 	 SYS_GPD_MFPL_PD2MFP_SPI0_CLK  },
    { PD_5, 	 SPI_1 , 	 SYS_GPD_MFPL_PD5MFP_SPI1_CLK  },
    { PE_4, 	 SPI_3 , 	 SYS_GPE_MFPL_PE4MFP_SPI3_CLK  },
    { PE_8, 	 SPI_2 , 	 SYS_GPE_MFPH_PE8MFP_SPI2_CLK  },
    { PF_8, 	 SPI_0 , 	 SYS_GPF_MFPH_PF8MFP_SPI0_CLK  },
    { PG_3, 	 SPI_2 , 	 SYS_GPG_MFPL_PG3MFP_SPI2_CLK  },
    { PG_6, 	 SPI_3 , 	 SYS_GPG_MFPL_PG6MFP_SPI3_CLK  },
    { PH_6, 	 SPI_1 , 	 SYS_GPH_MFPL_PH6MFP_SPI1_CLK  },
    { PH_8, 	 SPI_1 , 	 SYS_GPH_MFPH_PH8MFP_SPI1_CLK  },
    { NC,   NC,    0 }
};

//*** SPI_SSEL ***
const PinMap PinMap_SPI_SSEL[] = { 
    { PA_3, 	 SPI_0 , 	 SYS_GPA_MFPL_PA3MFP_SPI0_SS  },
    { PA_6, 	 SPI_1 , 	 SYS_GPA_MFPL_PA6MFP_SPI1_SS  },
    { PA_11, 	 SPI_2 , 	 SYS_GPA_MFPH_PA11MFP_SPI2_SS  },
    { PA_12, 	 SPI_2 , 	 SYS_GPA_MFPH_PA12MFP_SPI2_SS  },
    { PB_2, 	 SPI_1 , 	 SYS_GPB_MFPL_PB2MFP_SPI1_SS  },
    { PB_10, 	 SPI_3 , 	 SYS_GPB_MFPH_PB10MFP_SPI3_SS  },
    { PB_15, 	 SPI_0 , 	 SYS_GPB_MFPH_PB15MFP_SPI0_SS  },
    { PC_0, 	 SPI_1 , 	 SYS_GPC_MFPL_PC0MFP_SPI1_SS  },
    { PC_9, 	 SPI_3 , 	 SYS_GPC_MFPH_PC9MFP_SPI3_SS  },
    { PD_3, 	 SPI_0 , 	 SYS_GPD_MFPL_PD3MFP_SPI0_SS  },
    { PD_4, 	 SPI_1 , 	 SYS_GPD_MFPL_PD4MFP_SPI1_SS  },
    { PE_5, 	 SPI_3 , 	 SYS_GPE_MFPL_PE5MFP_SPI3_SS  },
    { PE_11, 	 SPI_2 , 	 SYS_GPE_MFPH_PE11MFP_SPI2_SS  },
    { PF_9, 	 SPI_0 , 	 SYS_GPF_MFPH_PF9MFP_SPI0_SS  },
    { PG_2, 	 SPI_2 , 	 SYS_GPG_MFPL_PG2MFP_SPI2_SS  },
    { PG_5, 	 SPI_3 , 	 SYS_GPG_MFPL_PG5MFP_SPI3_SS  },
    { PH_7, 	 SPI_1 , 	 SYS_GPH_MFPL_PH7MFP_SPI1_SS  },
    { PH_9, 	 SPI_1 , 	 SYS_GPH_MFPH_PH9MFP_SPI1_SS  },
    { NC,   NC,    0 }
};

//*** QSPI_D0 ***
const PinMap PinMap_QSPI_D0[] = { 
    { PA_0, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA0MFP_QSPI0_MOSI0  },
    { PC_0, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC0MFP_QSPI0_MOSI0  },
    { PE_0, 	 QSPI_0 , 	 SYS_GPE_MFPL_PE0MFP_QSPI0_MOSI0  },
    { NC,   NC,    0 }
};

//*** QSPI_D1 ***
const PinMap PinMap_QSPI_D1[] = { 
    { PA_1, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA1MFP_QSPI0_MISO0  },
    { PC_1, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC1MFP_QSPI0_MISO0  },
    { PE_1, 	 QSPI_0 , 	 SYS_GPE_MFPL_PE1MFP_QSPI0_MISO0  },
    { NC,   NC,    0 }
};

//*** QSPI_D2 ***
const PinMap PinMap_QSPI_D2[] = { 
    { PA_4, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA4MFP_QSPI0_MOSI1  },
    { PC_4, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC4MFP_QSPI0_MOSI1  },
    { PH_11, 	 QSPI_0 , 	 SYS_GPH_MFPH_PH11MFP_QSPI0_MOSI1  },
    { NC,   NC,    0 }
};

//*** QSPI_D3 ***
const PinMap PinMap_QSPI_D3[] = { 
    { PA_5, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA5MFP_QSPI0_MISO1  },
    { PC_5, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC5MFP_QSPI0_MISO1  },
    { PH_10, 	 QSPI_0 , 	 SYS_GPH_MFPH_PH10MFP_QSPI0_MISO1  },
    { NC,   NC,    0 }
};

//*** QSPI_SCLK ***
const PinMap PinMap_QSPI_SCLK[] = { 
    { PA_2, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA2MFP_QSPI0_CLK  },
    { PC_2, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC2MFP_QSPI0_CLK  },
    { PC_14, 	 QSPI_0 , 	 SYS_GPC_MFPH_PC14MFP_QSPI0_CLK  },
    { PF_2, 	 QSPI_0 , 	 SYS_GPF_MFPL_PF2MFP_QSPI0_CLK  },
    { PH_8, 	 QSPI_0 , 	 SYS_GPH_MFPH_PH8MFP_QSPI0_CLK  },
    { NC,   NC,    0 }
};

//*** QSPI_SSEL ***
const PinMap PinMap_QSPI_SSEL[] = { 
    { PA_3, 	 QSPI_0 , 	 SYS_GPA_MFPL_PA3MFP_QSPI0_SS  },
    { PC_3, 	 QSPI_0 , 	 SYS_GPC_MFPL_PC3MFP_QSPI0_SS  },
    { PH_9, 	 QSPI_0 , 	 SYS_GPH_MFPH_PH9MFP_QSPI0_SS  },
    { NC,   NC,    0 }
};

//*** SDH_DAT0 ***
const PinMap PinMap_SDH_DAT0[] = { 
    { PA_0, 	 SDH_1 , 	 SYS_GPA_MFPL_PA0MFP_SD1_DAT0  },
    { PA_8, 	 SDH_1 , 	 SYS_GPA_MFPH_PA8MFP_SD1_DAT0  },
    { PB_2, 	 SDH_0 , 	 SYS_GPB_MFPL_PB2MFP_SD0_DAT0  },
    { PE_2, 	 SDH_0 , 	 SYS_GPE_MFPL_PE2MFP_SD0_DAT0  },
    { PG_12, 	 SDH_1 , 	 SYS_GPG_MFPH_PG12MFP_SD1_DAT0  },
    { NC,   NC,    0 }
};

//*** SDH_DAT1 ***
const PinMap PinMap_SDH_DAT1[] = { 
    { PA_1, 	 SDH_1 , 	 SYS_GPA_MFPL_PA1MFP_SD1_DAT1  },
    { PA_9, 	 SDH_1 , 	 SYS_GPA_MFPH_PA9MFP_SD1_DAT1  },
    { PB_3, 	 SDH_0 , 	 SYS_GPB_MFPL_PB3MFP_SD0_DAT1  },
    { PE_3, 	 SDH_0 , 	 SYS_GPE_MFPL_PE3MFP_SD0_DAT1  },
    { PG_11, 	 SDH_1 , 	 SYS_GPG_MFPH_PG11MFP_SD1_DAT1  },
    { NC,   NC,    0 }
};

//*** SDH_DAT2 ***
const PinMap PinMap_SDH_DAT2[] = { 
    { PA_2, 	 SDH_1 , 	 SYS_GPA_MFPL_PA2MFP_SD1_DAT2  },
    { PA_10, 	 SDH_1 , 	 SYS_GPA_MFPH_PA10MFP_SD1_DAT2  },
    { PB_4, 	 SDH_0 , 	 SYS_GPB_MFPL_PB4MFP_SD0_DAT2  },
    { PE_4, 	 SDH_0 , 	 SYS_GPE_MFPL_PE4MFP_SD0_DAT2  },
    { PG_10, 	 SDH_1 , 	 SYS_GPG_MFPH_PG10MFP_SD1_DAT2  },
    { NC,   NC,    0 }
};

