alibaba/AliOS-Things/platform/mcu/m487jidae/hal/common/PeripheralPins.c
//*** SDH_DAT3 ***
const PinMap PinMap_SDH_DAT3[] = { 
    { PA_3, 	 SDH_1 , 	 SYS_GPA_MFPL_PA3MFP_SD1_DAT3  },
    { PA_11, 	 SDH_1 , 	 SYS_GPA_MFPH_PA11MFP_SD1_DAT3  },
    { PB_5, 	 SDH_0 , 	 SYS_GPB_MFPL_PB5MFP_SD0_DAT3  },
    { PE_5, 	 SDH_0 , 	 SYS_GPE_MFPL_PE5MFP_SD0_DAT3  },
    { PG_9, 	 SDH_1 , 	 SYS_GPG_MFPH_PG9MFP_SD1_DAT3  },
    { NC,   NC,    0 }
};

//*** SDH_CMD ***
const PinMap PinMap_SDH_CMD[] = { 
    { PA_5, 	 SDH_1 , 	 SYS_GPA_MFPL_PA5MFP_SD1_CMD  },
    { PB_0, 	 SDH_0 , 	 SYS_GPB_MFPL_PB0MFP_SD0_CMD  },
    { PB_7, 	 SDH_1 , 	 SYS_GPB_MFPL_PB7MFP_SD1_CMD  },
    { PE_7, 	 SDH_0 , 	 SYS_GPE_MFPL_PE7MFP_SD0_CMD  },
    { PG_13, 	 SDH_1 , 	 SYS_GPG_MFPH_PG13MFP_SD1_CMD  },
    { NC,   NC,    0 }
};

//*** SDH_CLK ***
const PinMap PinMap_SDH_CLK[] = { 
    { PA_4, 	 SDH_1 , 	 SYS_GPA_MFPL_PA4MFP_SD1_CLK  },
    { PB_1, 	 SDH_0 , 	 SYS_GPB_MFPL_PB1MFP_SD0_CLK  },
    { PB_6, 	 SDH_1 , 	 SYS_GPB_MFPL_PB6MFP_SD1_CLK  },
    { PE_6, 	 SDH_0 , 	 SYS_GPE_MFPL_PE6MFP_SD0_CLK  },
    { PG_14, 	 SDH_1 , 	 SYS_GPG_MFPH_PG14MFP_SD1_CLK  },
    { NC,   NC,    0 }
};

//*** SDH_CD ***
const PinMap PinMap_SDH_CD[] = { 
    { PA_6, 	 SDH_1 , 	 SYS_GPA_MFPL_PA6MFP_SD1_nCD  },
    { PB_12, 	 SDH_0 , 	 SYS_GPB_MFPH_PB12MFP_SD0_nCD  },
    { PD_13, 	 SDH_0 , 	 SYS_GPD_MFPH_PD13MFP_SD0_nCD  },
    { PE_14, 	 SDH_1 , 	 SYS_GPE_MFPH_PE14MFP_SD1_nCD  },
    { PG_15, 	 SDH_1 , 	 SYS_GPG_MFPH_PG15MFP_SD1_nCD  },
    { NC,   NC,    0 }
};

//*** CAN_TX ***
const PinMap PinMap_CAN_TX[] = { 
    { PA_5, 	 CAN_0 , 	 SYS_GPA_MFPL_PA5MFP_CAN0_TXD  },
    { PA_12, 	 CAN_0 , 	 SYS_GPA_MFPH_PA12MFP_CAN0_TXD  },
    { PB_7, 	 CAN_1 , 	 SYS_GPB_MFPL_PB7MFP_CAN1_TXD  },
    { PB_11, 	 CAN_0 , 	 SYS_GPB_MFPH_PB11MFP_CAN0_TXD  },
    { PC_3, 	 CAN_1 , 	 SYS_GPC_MFPL_PC3MFP_CAN1_TXD  },
    { PC_5, 	 CAN_0 , 	 SYS_GPC_MFPL_PC5MFP_CAN0_TXD  },
    { PC_10, 	 CAN_1 , 	 SYS_GPC_MFPH_PC10MFP_CAN1_TXD  },
    { PC_13, 	 CAN_1 , 	 SYS_GPC_MFPH_PC13MFP_CAN1_TXD  },
    { PD_11, 	 CAN_0 , 	 SYS_GPD_MFPH_PD11MFP_CAN0_TXD  },
    { PE_7, 	 CAN_1 , 	 SYS_GPE_MFPL_PE7MFP_CAN1_TXD  },
    { PE_14, 	 CAN_0 , 	 SYS_GPE_MFPH_PE14MFP_CAN0_TXD  },
    { PG_0, 	 CAN_1 , 	 SYS_GPG_MFPL_PG0MFP_CAN1_TXD  },
    { NC,   NC,    0 }
};

//*** CAN_RX ***
const PinMap PinMap_CAN_RX[] = { 
    { PA_4, 	 CAN_0 , 	 SYS_GPA_MFPL_PA4MFP_CAN0_RXD  },
    { PA_13, 	 CAN_0 , 	 SYS_GPA_MFPH_PA13MFP_CAN0_RXD  },
    { PB_6, 	 CAN_1 , 	 SYS_GPB_MFPL_PB6MFP_CAN1_RXD  },
    { PB_10, 	 CAN_0 , 	 SYS_GPB_MFPH_PB10MFP_CAN0_RXD  },
    { PC_2, 	 CAN_1 , 	 SYS_GPC_MFPL_PC2MFP_CAN1_RXD  },
    { PC_4, 	 CAN_0 , 	 SYS_GPC_MFPL_PC4MFP_CAN0_RXD  },
    { PC_9, 	 CAN_1 , 	 SYS_GPC_MFPH_PC9MFP_CAN1_RXD  },
    { PD_10, 	 CAN_0 , 	 SYS_GPD_MFPH_PD10MFP_CAN0_RXD  },
    { PD_12, 	 CAN_1 , 	 SYS_GPD_MFPH_PD12MFP_CAN1_RXD  },
    { PE_6, 	 CAN_1 , 	 SYS_GPE_MFPL_PE6MFP_CAN1_RXD  },
    { PE_15, 	 CAN_0 , 	 SYS_GPE_MFPH_PE15MFP_CAN0_RXD  },
    { PG_1, 	 CAN_1 , 	 SYS_GPG_MFPL_PG1MFP_CAN1_RXD  },
    { NC,   NC,    0 }
};

